bbbbx/ATMega16-note/ATMega16_homework1_LED/作业2/source/LED.c
#include <iom16v.h> 

void delay (int n)
{
  int i , j;
  for (i = 0 ; i < n ; i ++)  
    for(j = 0 ; j < 1141 ; j++)  ;
}

void main()
{
  DDRA = 0xff;
  PORTA = 0x00;
  DDRB = 0x00;
  PORTB = 0x03;
  while(1)
  {
    if ((PINB & (1<<PB0) ) == 0)  //判断是否按下按键1
    {
	  while (1)  
	  {
	    PORTA = 0x01;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x02;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x04;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x08;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x10;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x20;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x40;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
		PORTA = 0x80;
		delay(100);
		if((PINB & (1<<PB1) ) == 0)  //判断是否按下按键2
		{
		  PORTA = 0x00;
		  break;
		}
	  }
    }
  }
}